keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH69.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH69.
*/
#define	SRC_DMACH69	(SRC_DMA_DMA0_CH69)

/** \\brief  51C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003851Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH7.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH7.
*/
#define	SRC_DMACH7	(SRC_DMA_DMA0_CH7)

/** \\brief  618, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH70 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038618u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH70.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH70.
*/
#define	SRC_DMACH70	(SRC_DMA_DMA0_CH70)

/** \\brief  61C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH71 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003861Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH71.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH71.
*/
#define	SRC_DMACH71	(SRC_DMA_DMA0_CH71)

/** \\brief  620, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH72 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038620u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH72.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH72.
*/
#define	SRC_DMACH72	(SRC_DMA_DMA0_CH72)

/** \\brief  624, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH73 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038624u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH73.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH73.
*/
#define	SRC_DMACH73	(SRC_DMA_DMA0_CH73)

/** \\brief  628, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH74 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038628u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH74.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH74.
*/
#define	SRC_DMACH74	(SRC_DMA_DMA0_CH74)

/** \\brief  62C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH75 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003862Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH75.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH75.
*/
#define	SRC_DMACH75	(SRC_DMA_DMA0_CH75)

/** \\brief  630, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH76 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038630u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH76.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH76.
*/
#define	SRC_DMACH76	(SRC_DMA_DMA0_CH76)

/** \\brief  634, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH77 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038634u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH77.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH77.
*/
#define	SRC_DMACH77	(SRC_DMA_DMA0_CH77)

/** \\brief  638, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH78 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038638u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH78.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH78.
*/
#define	SRC_DMACH78	(SRC_DMA_DMA0_CH78)

/** \\brief  63C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH79 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003863Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH79.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH79.
*/
#define	SRC_DMACH79	(SRC_DMA_DMA0_CH79)

/** \\brief  520, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH8 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038520u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH8.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH8.
*/
#define	SRC_DMACH8	(SRC_DMA_DMA0_CH8)

/** \\brief  640, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH80 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038640u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH80.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH80.
*/
#define	SRC_DMACH80	(SRC_DMA_DMA0_CH80)

/** \\brief  644, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH81 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038644u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH81.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH81.
*/
#define	SRC_DMACH81	(SRC_DMA_DMA0_CH81)

/** \\brief  648, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH82 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038648u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH82.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH82.
*/
#define	SRC_DMACH82	(SRC_DMA_DMA0_CH82)

/** \\brief  64C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH83 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003864Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH83.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH83.
*/
#define	SRC_DMACH83	(SRC_DMA_DMA0_CH83)

/** \\brief  650, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH84 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038650u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH84.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH84.
*/
#define	SRC_DMACH84	(SRC_DMA_DMA0_CH84)

/** \\brief  654, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH85 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038654u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH85.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH85.
*/
#define	SRC_DMACH85	(SRC_DMA_DMA0_CH85)

/** \\brief  658, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH86 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038658u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH86.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH86.
*/
#define	SRC_DMACH86	(SRC_DMA_DMA0_CH86)

/** \\brief  65C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH87 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003865Cu)

