keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH87.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH87.
*/
#define	SRC_DMACH87	(SRC_DMA_DMA0_CH87)

/** \\brief  660, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH88 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038660u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH88.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH88.
*/
#define	SRC_DMACH88	(SRC_DMA_DMA0_CH88)

/** \\brief  664, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH89 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038664u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH89.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH89.
*/
#define	SRC_DMACH89	(SRC_DMA_DMA0_CH89)

/** \\brief  524, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH9 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038524u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH9.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH9.
*/
#define	SRC_DMACH9	(SRC_DMA_DMA0_CH9)

/** \\brief  668, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH90 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038668u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH90.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH90.
*/
#define	SRC_DMACH90	(SRC_DMA_DMA0_CH90)

/** \\brief  66C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH91 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003866Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH91.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH91.
*/
#define	SRC_DMACH91	(SRC_DMA_DMA0_CH91)

/** \\brief  670, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH92 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038670u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH92.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH92.
*/
#define	SRC_DMACH92	(SRC_DMA_DMA0_CH92)

/** \\brief  674, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH93 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038674u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH93.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH93.
*/
#define	SRC_DMACH93	(SRC_DMA_DMA0_CH93)

/** \\brief  678, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH94 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038678u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH94.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH94.
*/
#define	SRC_DMACH94	(SRC_DMA_DMA0_CH94)

/** \\brief  67C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH95 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003867Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH95.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH95.
*/
#define	SRC_DMACH95	(SRC_DMA_DMA0_CH95)

/** \\brief  680, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH96 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038680u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH96.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH96.
*/
#define	SRC_DMACH96	(SRC_DMA_DMA0_CH96)

/** \\brief  684, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH97 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038684u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH97.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH97.
*/
#define	SRC_DMACH97	(SRC_DMA_DMA0_CH97)

/** \\brief  688, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH98 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038688u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH98.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH98.
*/
#define	SRC_DMACH98	(SRC_DMA_DMA0_CH98)

/** \\brief  68C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH99 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003868Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH99.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH99.
*/
#define	SRC_DMACH99	(SRC_DMA_DMA0_CH99)

/** \\brief  4F0, DMA Error Service Request */
#define SRC_DMA_DMA0_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_ERR.
* To use register names with standard convension, please use SRC_DMA_DMA0_ERR.
*/
#define	SRC_DMAERR	(SRC_DMA_DMA0_ERR)

/** \\brief  B54, DSADC SRA Service Request */
#define SRC_DSADC_DSADC0_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B54u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC0_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC0_SRA.
*/
#define	SRC_DSADCSRA0	(SRC_DSADC_DSADC0_SRA)

/** \\brief  B50, DSADC SRM Service Request */
#define SRC_DSADC_DSADC0_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B50u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC0_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC0_SRM.
*/
#define	SRC_DSADCSRM0	(SRC_DSADC_DSADC0_SRM)

/** \\brief  B5C, DSADC SRA Service Request */
#define SRC_DSADC_DSADC1_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B5Cu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC1_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC1_SRA.
*/
#define	SRC_DSADCSRA1	(SRC_DSADC_DSADC1_SRA)

/** \\brief  B58, DSADC SRM Service Request */
#define SRC_DSADC_DSADC1_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B58u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC1_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC1_SRM.
*/
#define	SRC_DSADCSRM1	(SRC_DSADC_DSADC1_SRM)

/** \\brief  B64, DSADC SRA Service Request */
#define SRC_DSADC_DSADC2_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B64u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC2_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC2_SRA.
*/
#define	SRC_DSADCSRA2	(SRC_DSADC_DSADC2_SRA)

