keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS2_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS2_3.
*/
#define	SRC_GTMMCS23	(SRC_GTM_GTM0_MCS2_3)

/** \\brief  19D0, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS2_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399D0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS2_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS2_4.
*/
#define	SRC_GTMMCS24	(SRC_GTM_GTM0_MCS2_4)

/** \\brief  19D4, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS2_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399D4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS2_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS2_5.
*/
#define	SRC_GTMMCS25	(SRC_GTM_GTM0_MCS2_5)

/** \\brief  19D8, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS2_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399D8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS2_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS2_6.
*/
#define	SRC_GTMMCS26	(SRC_GTM_GTM0_MCS2_6)

/** \\brief  19DC, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS2_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399DCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS2_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS2_7.
*/
#define	SRC_GTMMCS27	(SRC_GTM_GTM0_MCS2_7)

/** \\brief  19E0, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS3_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399E0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_0.
*/
#define	SRC_GTMMCS30	(SRC_GTM_GTM0_MCS3_0)

/** \\brief  19E4, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS3_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399E4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_1.
*/
#define	SRC_GTMMCS31	(SRC_GTM_GTM0_MCS3_1)

/** \\brief  19E8, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS3_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399E8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_2.
*/
#define	SRC_GTMMCS32	(SRC_GTM_GTM0_MCS3_2)

/** \\brief  19EC, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS3_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399ECu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_3.
*/
#define	SRC_GTMMCS33	(SRC_GTM_GTM0_MCS3_3)

/** \\brief  19F0, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS3_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399F0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_4.
*/
#define	SRC_GTMMCS34	(SRC_GTM_GTM0_MCS3_4)

/** \\brief  19F4, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS3_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399F4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_5.
*/
#define	SRC_GTMMCS35	(SRC_GTM_GTM0_MCS3_5)

/** \\brief  19F8, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS3_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399F8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_6.
*/
#define	SRC_GTMMCS36	(SRC_GTM_GTM0_MCS3_6)

/** \\brief  19FC, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS3_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399FCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_7.
*/
#define	SRC_GTMMCS37	(SRC_GTM_GTM0_MCS3_7)

/** \\brief  1A00, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS4_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A00u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_0.
*/
#define	SRC_GTMMCS40	(SRC_GTM_GTM0_MCS4_0)

/** \\brief  1A04, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS4_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A04u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_1.
*/
#define	SRC_GTMMCS41	(SRC_GTM_GTM0_MCS4_1)

/** \\brief  1A08, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS4_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A08u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_2.
*/
#define	SRC_GTMMCS42	(SRC_GTM_GTM0_MCS4_2)

/** \\brief  1A0C, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS4_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A0Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_3.
*/
#define	SRC_GTMMCS43	(SRC_GTM_GTM0_MCS4_3)

/** \\brief  1A10, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS4_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A10u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_4.
*/
#define	SRC_GTMMCS44	(SRC_GTM_GTM0_MCS4_4)

/** \\brief  1A14, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS4_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A14u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_5.
*/
#define	SRC_GTMMCS45	(SRC_GTM_GTM0_MCS4_5)

/** \\brief  1A18, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS4_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A18u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_6.
*/
#define	SRC_GTMMCS46	(SRC_GTM_GTM0_MCS4_6)

/** \\brief  1A1C, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS4_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A1Cu)

