keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_7.
*/
#define	SRC_GTMMCS47	(SRC_GTM_GTM0_MCS4_7)

/** \\brief  1A20, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A20u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_0.
*/
#define	SRC_GTMMCS50	(SRC_GTM_GTM0_MCS5_0)

/** \\brief  1A24, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A24u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_1.
*/
#define	SRC_GTMMCS51	(SRC_GTM_GTM0_MCS5_1)

/** \\brief  1A28, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A28u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_2.
*/
#define	SRC_GTMMCS52	(SRC_GTM_GTM0_MCS5_2)

/** \\brief  1A2C, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A2Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_3.
*/
#define	SRC_GTMMCS53	(SRC_GTM_GTM0_MCS5_3)

/** \\brief  1A30, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A30u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_4.
*/
#define	SRC_GTMMCS54	(SRC_GTM_GTM0_MCS5_4)

/** \\brief  1A34, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A34u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_5.
*/
#define	SRC_GTMMCS55	(SRC_GTM_GTM0_MCS5_5)

/** \\brief  1A38, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A38u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_6.
*/
#define	SRC_GTMMCS56	(SRC_GTM_GTM0_MCS5_6)

/** \\brief  1A3C, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A3Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_7.
*/
#define	SRC_GTMMCS57	(SRC_GTM_GTM0_MCS5_7)

/** \\brief  162C, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003962Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_0.
*/
#define	SRC_GTMPSM00	(SRC_GTM_GTM0_PSM0_0)

/** \\brief  1630, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039630u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_1.
*/
#define	SRC_GTMPSM01	(SRC_GTM_GTM0_PSM0_1)

/** \\brief  1634, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039634u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_2.
*/
#define	SRC_GTMPSM02	(SRC_GTM_GTM0_PSM0_2)

/** \\brief  1638, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039638u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_3.
*/
#define	SRC_GTMPSM03	(SRC_GTM_GTM0_PSM0_3)

/** \\brief  163C, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003963Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_4.
*/
#define	SRC_GTMPSM04	(SRC_GTM_GTM0_PSM0_4)

/** \\brief  1640, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039640u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_5.
*/
#define	SRC_GTMPSM05	(SRC_GTM_GTM0_PSM0_5)

/** \\brief  1644, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039644u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_6.
*/
#define	SRC_GTMPSM06	(SRC_GTM_GTM0_PSM0_6)

/** \\brief  1648, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039648u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_7.
*/
#define	SRC_GTMPSM07	(SRC_GTM_GTM0_PSM0_7)

/** \\brief  164C, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM1_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003964Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_0.
*/
#define	SRC_GTMPSM10	(SRC_GTM_GTM0_PSM1_0)

/** \\brief  1650, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM1_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039650u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_1.
*/
#define	SRC_GTMPSM11	(SRC_GTM_GTM0_PSM1_1)

/** \\brief  1654, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM1_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039654u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_2.
*/
#define	SRC_GTMPSM12	(SRC_GTM_GTM0_PSM1_2)

/** \\brief  1658, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM1_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039658u)

