keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_6.
*/
#define	SRC_GTMTIM36	(SRC_GTM_GTM0_TIM3_6)

/** \\brief  17FC, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397FCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_7.
*/
#define	SRC_GTMTIM37	(SRC_GTM_GTM0_TIM3_7)

/** \\brief  1800, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039800u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_0.
*/
#define	SRC_GTMTIM40	(SRC_GTM_GTM0_TIM4_0)

/** \\brief  1804, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039804u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_1.
*/
#define	SRC_GTMTIM41	(SRC_GTM_GTM0_TIM4_1)

/** \\brief  1808, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039808u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_2.
*/
#define	SRC_GTMTIM42	(SRC_GTM_GTM0_TIM4_2)

/** \\brief  180C, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003980Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_3.
*/
#define	SRC_GTMTIM43	(SRC_GTM_GTM0_TIM4_3)

/** \\brief  1810, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039810u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_4.
*/
#define	SRC_GTMTIM44	(SRC_GTM_GTM0_TIM4_4)

/** \\brief  1814, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039814u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_5.
*/
#define	SRC_GTMTIM45	(SRC_GTM_GTM0_TIM4_5)

/** \\brief  1818, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039818u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_6.
*/
#define	SRC_GTMTIM46	(SRC_GTM_GTM0_TIM4_6)

/** \\brief  181C, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003981Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_7.
*/
#define	SRC_GTMTIM47	(SRC_GTM_GTM0_TIM4_7)

/** \\brief  1820, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039820u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_0.
*/
#define	SRC_GTMTIM50	(SRC_GTM_GTM0_TIM5_0)

/** \\brief  1824, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039824u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_1.
*/
#define	SRC_GTMTIM51	(SRC_GTM_GTM0_TIM5_1)

/** \\brief  1828, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039828u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_2.
*/
#define	SRC_GTMTIM52	(SRC_GTM_GTM0_TIM5_2)

/** \\brief  182C, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003982Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_3.
*/
#define	SRC_GTMTIM53	(SRC_GTM_GTM0_TIM5_3)

/** \\brief  1830, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039830u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_4.
*/
#define	SRC_GTMTIM54	(SRC_GTM_GTM0_TIM5_4)

/** \\brief  1834, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039834u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_5.
*/
#define	SRC_GTMTIM55	(SRC_GTM_GTM0_TIM5_5)

/** \\brief  1838, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039838u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_6.
*/
#define	SRC_GTMTIM56	(SRC_GTM_GTM0_TIM5_6)

/** \\brief  183C, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003983Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_7.
*/
#define	SRC_GTMTIM57	(SRC_GTM_GTM0_TIM5_7)

/** \\brief  1B80, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM0_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039B80u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_0.
*/
#define	SRC_GTMTOM00	(SRC_GTM_GTM0_TOM0_0)

/** \\brief  1B84, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM0_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039B84u)

