keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSrc_reg.h
/** \\brief  1BD8, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM2_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BD8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM2_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM2_6.
*/
#define	SRC_GTMTOM26	(SRC_GTM_GTM0_TOM2_6)

/** \\brief  1BDC, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM2_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BDCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM2_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM2_7.
*/
#define	SRC_GTMTOM27	(SRC_GTM_GTM0_TOM2_7)

/** \\brief  1BE0, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BE0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_0.
*/
#define	SRC_GTMTOM30	(SRC_GTM_GTM0_TOM3_0)

/** \\brief  1BE4, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BE4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_1.
*/
#define	SRC_GTMTOM31	(SRC_GTM_GTM0_TOM3_1)

/** \\brief  1BE8, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BE8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_2.
*/
#define	SRC_GTMTOM32	(SRC_GTM_GTM0_TOM3_2)

/** \\brief  1BEC, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BECu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_3.
*/
#define	SRC_GTMTOM33	(SRC_GTM_GTM0_TOM3_3)

/** \\brief  1BF0, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BF0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_4.
*/
#define	SRC_GTMTOM34	(SRC_GTM_GTM0_TOM3_4)

/** \\brief  1BF4, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BF4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_5.
*/
#define	SRC_GTMTOM35	(SRC_GTM_GTM0_TOM3_5)

/** \\brief  1BF8, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BF8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_6.
*/
#define	SRC_GTMTOM36	(SRC_GTM_GTM0_TOM3_6)

/** \\brief  1BFC, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BFCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_7.
*/
#define	SRC_GTMTOM37	(SRC_GTM_GTM0_TOM3_7)

/** \\brief  1C00, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C00u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_0.
*/
#define	SRC_GTMTOM40	(SRC_GTM_GTM0_TOM4_0)

/** \\brief  1C04, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C04u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_1.
*/
#define	SRC_GTMTOM41	(SRC_GTM_GTM0_TOM4_1)

/** \\brief  1C08, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C08u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_2.
*/
#define	SRC_GTMTOM42	(SRC_GTM_GTM0_TOM4_2)

/** \\brief  1C0C, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C0Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_3.
*/
#define	SRC_GTMTOM43	(SRC_GTM_GTM0_TOM4_3)

/** \\brief  1C10, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C10u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_4.
*/
#define	SRC_GTMTOM44	(SRC_GTM_GTM0_TOM4_4)

/** \\brief  1C14, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C14u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_5.
*/
#define	SRC_GTMTOM45	(SRC_GTM_GTM0_TOM4_5)

/** \\brief  1C18, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C18u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_6.
*/
#define	SRC_GTMTOM46	(SRC_GTM_GTM0_TOM4_6)

/** \\brief  1C1C, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C1Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_7.
*/
#define	SRC_GTMTOM47	(SRC_GTM_GTM0_TOM4_7)

/** \\brief  290, HSCT Service Request */
#define SRC_HSCT_HSCT0_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038290u)

/** Alias (User Manual Name) for SRC_HSCT_HSCT0_SR.
* To use register names with standard convension, please use SRC_HSCT_HSCT0_SR.
*/
#define	SRC_HSCT	(SRC_HSCT_HSCT0_SR)

