keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_I2C_I2C0_ERR.
* To use register names with standard convension, please use SRC_I2C_I2C0_ERR.
*/
#define	SRC_I2C0ERR	(SRC_I2C_I2C0_ERR)

/** \\brief  304, I2C Last Burst Data Transfer Service Request */
#define SRC_I2C_I2C0_LBREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038304u)

/** Alias (User Manual Name) for SRC_I2C_I2C0_LBREQ.
* To use register names with standard convension, please use SRC_I2C_I2C0_LBREQ.
*/
#define	SRC_I2C0LBREQ	(SRC_I2C_I2C0_LBREQ)

/** \\brief  30C, I2C Last Single Data Transfer Service Request */
#define SRC_I2C_I2C0_LSREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003830Cu)

/** Alias (User Manual Name) for SRC_I2C_I2C0_LSREQ.
* To use register names with standard convension, please use SRC_I2C_I2C0_LSREQ.
*/
#define	SRC_I2C0LSREQ	(SRC_I2C_I2C0_LSREQ)

/** \\brief  314, I2C Kernel Service Request */
#define SRC_I2C_I2C0_P /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038314u)

/** Alias (User Manual Name) for SRC_I2C_I2C0_P.
* To use register names with standard convension, please use SRC_I2C_I2C0_P.
*/
#define	SRC_I2C0P	(SRC_I2C_I2C0_P)

/** \\brief  308, I2C Single Data Transfer Service Request */
#define SRC_I2C_I2C0_SREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038308u)

/** Alias (User Manual Name) for SRC_I2C_I2C0_SREQ.
* To use register names with standard convension, please use SRC_I2C_I2C0_SREQ.
*/
#define	SRC_I2C0SREQ	(SRC_I2C_I2C0_SREQ)

/** \\brief  318, I2C Burst Data Transfer Request */
#define SRC_I2C_I2C1_BREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038318u)

/** Alias (User Manual Name) for SRC_I2C_I2C1_BREQ.
* To use register names with standard convension, please use SRC_I2C_I2C1_BREQ.
*/
#define	SRC_I2C1BREQ	(SRC_I2C_I2C1_BREQ)

/** \\brief  328, I2C Error Service Request */
#define SRC_I2C_I2C1_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038328u)

/** Alias (User Manual Name) for SRC_I2C_I2C1_ERR.
* To use register names with standard convension, please use SRC_I2C_I2C1_ERR.
*/
#define	SRC_I2C1ERR	(SRC_I2C_I2C1_ERR)

/** \\brief  31C, I2C Last Burst Data Transfer Service Request */
#define SRC_I2C_I2C1_LBREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003831Cu)

/** Alias (User Manual Name) for SRC_I2C_I2C1_LBREQ.
* To use register names with standard convension, please use SRC_I2C_I2C1_LBREQ.
*/
#define	SRC_I2C1LBREQ	(SRC_I2C_I2C1_LBREQ)

/** \\brief  324, I2C Last Single Data Transfer Service Request */
#define SRC_I2C_I2C1_LSREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038324u)

/** Alias (User Manual Name) for SRC_I2C_I2C1_LSREQ.
* To use register names with standard convension, please use SRC_I2C_I2C1_LSREQ.
*/
#define	SRC_I2C1LSREQ	(SRC_I2C_I2C1_LSREQ)

/** \\brief  32C, I2C Kernel Service Request */
#define SRC_I2C_I2C1_P /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003832Cu)

/** Alias (User Manual Name) for SRC_I2C_I2C1_P.
* To use register names with standard convension, please use SRC_I2C_I2C1_P.
*/
#define	SRC_I2C1P	(SRC_I2C_I2C1_P)

/** \\brief  320, I2C Single Data Transfer Service Request */
#define SRC_I2C_I2C1_SREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038320u)

/** Alias (User Manual Name) for SRC_I2C_I2C1_SREQ.
* To use register names with standard convension, please use SRC_I2C_I2C1_SREQ.
*/
#define	SRC_I2C1SREQ	(SRC_I2C_I2C1_SREQ)

/** \\brief  DE0, LMU Service Request */
#define SRC_LMU_LMU0_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DE0u)

/** Alias (User Manual Name) for SRC_LMU_LMU0_SR.
* To use register names with standard convension, please use SRC_LMU_LMU0_SR.
*/
#define	SRC_LMU	(SRC_LMU_LMU0_SR)

/** \\brief  3E0, MSC Service Request 0 */
#define SRC_MSC_MSC0_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00383E0u)

/** Alias (User Manual Name) for SRC_MSC_MSC0_SR0.
* To use register names with standard convension, please use SRC_MSC_MSC0_SR0.
*/
#define	SRC_MSC0SR0	(SRC_MSC_MSC0_SR0)

/** \\brief  3E4, MSC Service Request 1 */
#define SRC_MSC_MSC0_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00383E4u)

/** Alias (User Manual Name) for SRC_MSC_MSC0_SR1.
* To use register names with standard convension, please use SRC_MSC_MSC0_SR1.
*/
#define	SRC_MSC0SR1	(SRC_MSC_MSC0_SR1)

/** \\brief  3E8, MSC Service Request 2 */
#define SRC_MSC_MSC0_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00383E8u)

/** Alias (User Manual Name) for SRC_MSC_MSC0_SR2.
* To use register names with standard convension, please use SRC_MSC_MSC0_SR2.
*/
#define	SRC_MSC0SR2	(SRC_MSC_MSC0_SR2)

/** \\brief  3EC, MSC Service Request 3 */
#define SRC_MSC_MSC0_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00383ECu)

/** Alias (User Manual Name) for SRC_MSC_MSC0_SR3.
* To use register names with standard convension, please use SRC_MSC_MSC0_SR3.
*/
#define	SRC_MSC0SR3	(SRC_MSC_MSC0_SR3)

/** \\brief  3F0, MSC Service Request 4 */
#define SRC_MSC_MSC0_SR4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00383F0u)

/** Alias (User Manual Name) for SRC_MSC_MSC0_SR4.
* To use register names with standard convension, please use SRC_MSC_MSC0_SR4.
*/
#define	SRC_MSC0SR4	(SRC_MSC_MSC0_SR4)

/** \\brief  3F4, MSC Service Request 0 */
#define SRC_MSC_MSC1_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00383F4u)

/** Alias (User Manual Name) for SRC_MSC_MSC1_SR0.
* To use register names with standard convension, please use SRC_MSC_MSC1_SR0.
*/
#define	SRC_MSC1SR0	(SRC_MSC_MSC1_SR0)

/** \\brief  3F8, MSC Service Request 1 */
#define SRC_MSC_MSC1_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00383F8u)

/** Alias (User Manual Name) for SRC_MSC_MSC1_SR1.
* To use register names with standard convension, please use SRC_MSC_MSC1_SR1.
*/
#define	SRC_MSC1SR1	(SRC_MSC_MSC1_SR1)

/** \\brief  3FC, MSC Service Request 2 */
#define SRC_MSC_MSC1_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00383FCu)

/** Alias (User Manual Name) for SRC_MSC_MSC1_SR2.
* To use register names with standard convension, please use SRC_MSC_MSC1_SR2.
*/
#define	SRC_MSC1SR2	(SRC_MSC_MSC1_SR2)

/** \\brief  400, MSC Service Request 3 */
#define SRC_MSC_MSC1_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038400u)

