keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSrc_reg.h
/** \\brief  1C4, QSPI Receive Service Request */
#define SRC_QSPI_QSPI2_RX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381C4u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI2_RX.
* To use register names with standard convension, please use SRC_QSPI_QSPI2_RX.
*/
#define	SRC_QSPI2RX	(SRC_QSPI_QSPI2_RX)

/** \\brief  1C0, QSPI Transmit Service Request */
#define SRC_QSPI_QSPI2_TX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381C0u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI2_TX.
* To use register names with standard convension, please use SRC_QSPI_QSPI2_TX.
*/
#define	SRC_QSPI2TX	(SRC_QSPI_QSPI2_TX)

/** \\brief  1D4, QSPI User Defined Service Request */
#define SRC_QSPI_QSPI2_U /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381D4u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI2_U.
* To use register names with standard convension, please use SRC_QSPI_QSPI2_U.
*/
#define	SRC_QSPI2U	(SRC_QSPI_QSPI2_U)

/** \\brief  1E0, QSPI Error Service Request */
#define SRC_QSPI_QSPI3_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381E0u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI3_ERR.
* To use register names with standard convension, please use SRC_QSPI_QSPI3_ERR.
*/
#define	SRC_QSPI3ERR	(SRC_QSPI_QSPI3_ERR)

/** \\brief  1E8, QSPI Half Cycle Service Request */
#define SRC_QSPI_QSPI3_HC /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381E8u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI3_HC.
* To use register names with standard convension, please use SRC_QSPI_QSPI3_HC.
*/
#define	SRC_QSPI3HC	(SRC_QSPI_QSPI3_HC)

/** \\brief  1E4, QSPI Phase Transition Service Request */
#define SRC_QSPI_QSPI3_PT /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381E4u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI3_PT.
* To use register names with standard convension, please use SRC_QSPI_QSPI3_PT.
*/
#define	SRC_QSPI3PT	(SRC_QSPI_QSPI3_PT)

/** \\brief  1DC, QSPI Receive Service Request */
#define SRC_QSPI_QSPI3_RX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381DCu)

/** Alias (User Manual Name) for SRC_QSPI_QSPI3_RX.
* To use register names with standard convension, please use SRC_QSPI_QSPI3_RX.
*/
#define	SRC_QSPI3RX	(SRC_QSPI_QSPI3_RX)

/** \\brief  1D8, QSPI Transmit Service Request */
#define SRC_QSPI_QSPI3_TX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381D8u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI3_TX.
* To use register names with standard convension, please use SRC_QSPI_QSPI3_TX.
*/
#define	SRC_QSPI3TX	(SRC_QSPI_QSPI3_TX)

/** \\brief  1EC, QSPI User Defined Service Request */
#define SRC_QSPI_QSPI3_U /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381ECu)

/** Alias (User Manual Name) for SRC_QSPI_QSPI3_U.
* To use register names with standard convension, please use SRC_QSPI_QSPI3_U.
*/
#define	SRC_QSPI3U	(SRC_QSPI_QSPI3_U)

/** \\brief  1F8, QSPI Error Service Request */
#define SRC_QSPI_QSPI4_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381F8u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI4_ERR.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_ERR.
*/
#define	SRC_QSPI4ERR	(SRC_QSPI_QSPI4_ERR)

/** \\brief  200, QSPI Half Cycle Service Request */
#define SRC_QSPI_QSPI4_HC /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038200u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI4_HC.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_HC.
*/
#define	SRC_QSPI4HC	(SRC_QSPI_QSPI4_HC)

/** \\brief  1FC, QSPI Phase Transition Service Request */
#define SRC_QSPI_QSPI4_PT /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381FCu)

/** Alias (User Manual Name) for SRC_QSPI_QSPI4_PT.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_PT.
*/
#define	SRC_QSPI4PT	(SRC_QSPI_QSPI4_PT)

/** \\brief  1F4, QSPI Receive Service Request */
#define SRC_QSPI_QSPI4_RX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381F4u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI4_RX.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_RX.
*/
#define	SRC_QSPI4RX	(SRC_QSPI_QSPI4_RX)

/** \\brief  1F0, QSPI Transmit Service Request */
#define SRC_QSPI_QSPI4_TX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381F0u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI4_TX.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_TX.
*/
#define	SRC_QSPI4TX	(SRC_QSPI_QSPI4_TX)

/** \\brief  204, QSPI User Defined Service Request */
#define SRC_QSPI_QSPI4_U /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038204u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI4_U.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_U.
*/
#define	SRC_QSPI4U	(SRC_QSPI_QSPI4_U)

/** \\brief  210, QSPI Error Service Request */
#define SRC_QSPI_QSPI5_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038210u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_ERR.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_ERR.
*/
#define	SRC_QSPI5ERR	(SRC_QSPI_QSPI5_ERR)

/** \\brief  218, QSPI Half Cycle Service Request */
#define SRC_QSPI_QSPI5_HC /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038218u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_HC.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_HC.
*/
#define	SRC_QSPI5HC	(SRC_QSPI_QSPI5_HC)

/** \\brief  214, QSPI Phase Transition Service Request */
#define SRC_QSPI_QSPI5_PT /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038214u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_PT.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_PT.
*/
#define	SRC_QSPI5PT	(SRC_QSPI_QSPI5_PT)

/** \\brief  20C, QSPI Receive Service Request */
#define SRC_QSPI_QSPI5_RX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003820Cu)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_RX.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_RX.
*/
#define	SRC_QSPI5RX	(SRC_QSPI_QSPI5_RX)

/** \\brief  208, QSPI Transmit Service Request */
#define SRC_QSPI_QSPI5_TX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038208u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_TX.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_TX.
*/
#define	SRC_QSPI5TX	(SRC_QSPI_QSPI5_TX)

/** \\brief  21C, QSPI User Defined Service Request */
#define SRC_QSPI_QSPI5_U /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003821Cu)

