keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_QSPI_QSPI5_U.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_U.
*/
#define	SRC_QSPI5U	(SRC_QSPI_QSPI5_U)

/** \\brief  CD0, SCU DTS Busy Service Request */
#define SRC_SCU_SCU_DTS /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CD0u)

/** Alias (User Manual Name) for SRC_SCU_SCU_DTS.
* To use register names with standard convension, please use SRC_SCU_SCU_DTS.
*/
#define	SRC_SCUDTS	(SRC_SCU_SCU_DTS)

/** \\brief  CD4, SCU ERU Service Request */
#define SRC_SCU_SCU_ERU0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CD4u)

/** Alias (User Manual Name) for SRC_SCU_SCU_ERU0.
* To use register names with standard convension, please use SRC_SCU_SCU_ERU0.
*/
#define	SRC_SCUERU0	(SRC_SCU_SCU_ERU0)

/** \\brief  CD8, SCU ERU Service Request */
#define SRC_SCU_SCU_ERU1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CD8u)

/** Alias (User Manual Name) for SRC_SCU_SCU_ERU1.
* To use register names with standard convension, please use SRC_SCU_SCU_ERU1.
*/
#define	SRC_SCUERU1	(SRC_SCU_SCU_ERU1)

/** \\brief  CDC, SCU ERU Service Request */
#define SRC_SCU_SCU_ERU2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CDCu)

/** Alias (User Manual Name) for SRC_SCU_SCU_ERU2.
* To use register names with standard convension, please use SRC_SCU_SCU_ERU2.
*/
#define	SRC_SCUERU2	(SRC_SCU_SCU_ERU2)

/** \\brief  CE0, SCU ERU Service Request */
#define SRC_SCU_SCU_ERU3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CE0u)

/** Alias (User Manual Name) for SRC_SCU_SCU_ERU3.
* To use register names with standard convension, please use SRC_SCU_SCU_ERU3.
*/
#define	SRC_SCUERU3	(SRC_SCU_SCU_ERU3)

/** \\brief  350, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038350u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR0.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR0.
*/
#define	SRC_SENT0	(SRC_SENT_SENT0_SR0)

/** \\brief  354, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038354u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR1.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR1.
*/
#define	SRC_SENT1	(SRC_SENT_SENT0_SR1)

/** \\brief  378, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR10 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038378u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR10.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR10.
*/
#define	SRC_SENT10	(SRC_SENT_SENT0_SR10)

/** \\brief  37C, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR11 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003837Cu)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR11.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR11.
*/
#define	SRC_SENT11	(SRC_SENT_SENT0_SR11)

/** \\brief  380, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR12 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038380u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR12.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR12.
*/
#define	SRC_SENT12	(SRC_SENT_SENT0_SR12)

/** \\brief  384, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR13 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038384u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR13.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR13.
*/
#define	SRC_SENT13	(SRC_SENT_SENT0_SR13)

/** \\brief  388, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR14 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038388u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR14.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR14.
*/
#define	SRC_SENT14	(SRC_SENT_SENT0_SR14)

/** \\brief  358, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038358u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR2.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR2.
*/
#define	SRC_SENT2	(SRC_SENT_SENT0_SR2)

/** \\brief  35C, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003835Cu)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR3.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR3.
*/
#define	SRC_SENT3	(SRC_SENT_SENT0_SR3)

/** \\brief  360, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038360u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR4.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR4.
*/
#define	SRC_SENT4	(SRC_SENT_SENT0_SR4)

/** \\brief  364, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038364u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR5.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR5.
*/
#define	SRC_SENT5	(SRC_SENT_SENT0_SR5)

/** \\brief  368, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038368u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR6.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR6.
*/
#define	SRC_SENT6	(SRC_SENT_SENT0_SR6)

/** \\brief  36C, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003836Cu)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR7.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR7.
*/
#define	SRC_SENT7	(SRC_SENT_SENT0_SR7)

/** \\brief  370, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR8 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038370u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR8.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR8.
*/
#define	SRC_SENT8	(SRC_SENT_SENT0_SR8)

/** \\brief  374, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR9 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038374u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR9.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR9.
*/
#define	SRC_SENT9	(SRC_SENT_SENT0_SR9)

/** \\brief  D10, SMU Service Request */
#define SRC_SMU_SMU0_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D10u)

