keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_VADC_G5_SR3.
* To use register names with standard convension, please use SRC_VADC_G5_SR3.
*/
#define	SRC_VADCG5SR3	(SRC_VADC_G5_SR3)

/** \\brief  9E0, VADC Group  Service Request 0 */
#define SRC_VADC_G6_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389E0u)

/** Alias (User Manual Name) for SRC_VADC_G6_SR0.
* To use register names with standard convension, please use SRC_VADC_G6_SR0.
*/
#define	SRC_VADCG6SR0	(SRC_VADC_G6_SR0)

/** \\brief  9E4, VADC Group  Service Request 1 */
#define SRC_VADC_G6_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389E4u)

/** Alias (User Manual Name) for SRC_VADC_G6_SR1.
* To use register names with standard convension, please use SRC_VADC_G6_SR1.
*/
#define	SRC_VADCG6SR1	(SRC_VADC_G6_SR1)

/** \\brief  9E8, VADC Group  Service Request 2 */
#define SRC_VADC_G6_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389E8u)

/** Alias (User Manual Name) for SRC_VADC_G6_SR2.
* To use register names with standard convension, please use SRC_VADC_G6_SR2.
*/
#define	SRC_VADCG6SR2	(SRC_VADC_G6_SR2)

/** \\brief  9EC, VADC Group  Service Request 3 */
#define SRC_VADC_G6_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389ECu)

/** Alias (User Manual Name) for SRC_VADC_G6_SR3.
* To use register names with standard convension, please use SRC_VADC_G6_SR3.
*/
#define	SRC_VADCG6SR3	(SRC_VADC_G6_SR3)

/** \\brief  9F0, VADC Group  Service Request 0 */
#define SRC_VADC_G7_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389F0u)

/** Alias (User Manual Name) for SRC_VADC_G7_SR0.
* To use register names with standard convension, please use SRC_VADC_G7_SR0.
*/
#define	SRC_VADCG7SR0	(SRC_VADC_G7_SR0)

/** \\brief  9F4, VADC Group  Service Request 1 */
#define SRC_VADC_G7_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389F4u)

/** Alias (User Manual Name) for SRC_VADC_G7_SR1.
* To use register names with standard convension, please use SRC_VADC_G7_SR1.
*/
#define	SRC_VADCG7SR1	(SRC_VADC_G7_SR1)

/** \\brief  9F8, VADC Group  Service Request 2 */
#define SRC_VADC_G7_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389F8u)

/** Alias (User Manual Name) for SRC_VADC_G7_SR2.
* To use register names with standard convension, please use SRC_VADC_G7_SR2.
*/
#define	SRC_VADCG7SR2	(SRC_VADC_G7_SR2)

/** \\brief  9FC, VADC Group  Service Request 3 */
#define SRC_VADC_G7_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389FCu)

/** Alias (User Manual Name) for SRC_VADC_G7_SR3.
* To use register names with standard convension, please use SRC_VADC_G7_SR3.
*/
#define	SRC_VADCG7SR3	(SRC_VADC_G7_SR3)

/** \\brief  A00, VADC Group  Service Request 0 */
#define SRC_VADC_G8_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A00u)

/** Alias (User Manual Name) for SRC_VADC_G8_SR0.
* To use register names with standard convension, please use SRC_VADC_G8_SR0.
*/
#define	SRC_VADCG8SR0	(SRC_VADC_G8_SR0)

/** \\brief  A04, VADC Group  Service Request 1 */
#define SRC_VADC_G8_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A04u)

/** Alias (User Manual Name) for SRC_VADC_G8_SR1.
* To use register names with standard convension, please use SRC_VADC_G8_SR1.
*/
#define	SRC_VADCG8SR1	(SRC_VADC_G8_SR1)

/** \\brief  A08, VADC Group  Service Request 2 */
#define SRC_VADC_G8_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A08u)

/** Alias (User Manual Name) for SRC_VADC_G8_SR2.
* To use register names with standard convension, please use SRC_VADC_G8_SR2.
*/
#define	SRC_VADCG8SR2	(SRC_VADC_G8_SR2)

/** \\brief  A0C, VADC Group  Service Request 3 */
#define SRC_VADC_G8_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A0Cu)

/** Alias (User Manual Name) for SRC_VADC_G8_SR3.
* To use register names with standard convension, please use SRC_VADC_G8_SR3.
*/
#define	SRC_VADCG8SR3	(SRC_VADC_G8_SR3)

/** \\brief  A10, VADC Group  Service Request 0 */
#define SRC_VADC_G9_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A10u)

/** Alias (User Manual Name) for SRC_VADC_G9_SR0.
* To use register names with standard convension, please use SRC_VADC_G9_SR0.
*/
#define	SRC_VADCG9SR0	(SRC_VADC_G9_SR0)

/** \\brief  A14, VADC Group  Service Request 1 */
#define SRC_VADC_G9_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A14u)

/** Alias (User Manual Name) for SRC_VADC_G9_SR1.
* To use register names with standard convension, please use SRC_VADC_G9_SR1.
*/
#define	SRC_VADCG9SR1	(SRC_VADC_G9_SR1)

/** \\brief  A18, VADC Group  Service Request 2 */
#define SRC_VADC_G9_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A18u)

/** Alias (User Manual Name) for SRC_VADC_G9_SR2.
* To use register names with standard convension, please use SRC_VADC_G9_SR2.
*/
#define	SRC_VADCG9SR2	(SRC_VADC_G9_SR2)

/** \\brief  A1C, VADC Group  Service Request 3 */
#define SRC_VADC_G9_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A1Cu)

/** Alias (User Manual Name) for SRC_VADC_G9_SR3.
* To use register names with standard convension, please use SRC_VADC_G9_SR3.
*/
#define	SRC_VADCG9SR3	(SRC_VADC_G9_SR3)

/** \\brief  48, XBAR_SRI Service Request */
#define SRC_XBAR_XBAR_SRC /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038048u)

/** Alias (User Manual Name) for SRC_XBAR_XBAR_SRC.
* To use register names with standard convension, please use SRC_XBAR_XBAR_SRC.
*/
#define	SRC_XBARSRC	(SRC_XBAR_XBAR_SRC)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSRC_REG_H */
